#include "contents.h"
#include<iostream>
using namespace std;
Contents::Contents()
{
    cout << "Введите в поле параметров командной строки номер задачи " << endl << endl;
    cout << "2. Создайте структуру для хранения дробей. Структура должна иметь 2 члена: целочисленный числитель и целочисленный знаменатель. Объявите 2 дробные переменные и получите их значения от пользователя. Напишите функцию multiply (параметрами будут эти две переменные), которая будет умножать эти числа и выводить результат."
         << endl
         << endl;
    cout << "3. Создайте структуру данных о себе. Передайте ее в функцию и выведите данные в консоль. Проинициализируйте структуру статически и динамически. Используйте ссылку на структуру."
         << endl
         << endl;
    cout << "4. Дополнительно. Использовать максимально весь материал для решения индивидуальной задачи. Реализовать свой протокол для передачи данных между PC и устройством."
         << endl;
}
