ЧТО ЭТО

штука для изучения программирования консольных с++ приложений,
пользовательский код нужно располагать в mymain.cpp|mymain.h как будто это обычный main().
вывод cout,cerr,clog и printf перехватывает и пишет в окно QT-приложения.


TODO

- добавить сохранение "консоли" в файл
- добавить настройку цветов "консоли"
- обработать закрытие окна
+ вынести код обработки перехвата и окна "консоли" из MainWindow в отдельный класс
- добавить тесты (?)
- организовать перехват printf (stdout, SetStdHandle, pipe ? без дисковых файлов)
+ организовать ввод данных как минимум DialogBox'ом
- организовать перехват cin
    проблема 1: конструкция "cin >> var >> ... >> varN" в исходнике.
                замена или макросом или препроцессором?
    проблема 2: поле ввода поверх QtextBrowser,
                или замена на QtextEdit с одной строкой ввода(?) и перхват <enter>,
                или для начала ввод в всплывающем QDialog

 ---------------------------

 Лаб_5Н (“Стек и Куча. Динамическое выделение памяти. Операторы new и delete С++”)

    Task: 4. Создайте функции работы с памятью создать, удалить, перераспределить, очистить,
    скопировать, используя malloc, calloc, realloc, memset, memcpy.
    ==
    Solution: Class GiveMeMem

 Лаб_6Н (“Ссылки С++”)

    Task: 2. Составить программу, которая будет печатать ромб (можно фигуру  или надпись по выбору)
    любым из  символов. В программе используйте ссылки на переменную и массив.
    ==
    Solution: Class LogoTip
